<?php
//Получаем данные
$country = $_POST["country"];
$city = $_POST["city"];
$weigth = $_POST["weigth"];
$unit = $_POST["unit"];


//Коэфициент кг в фунты
$c = 0.453592;

//Если вес фунтах - переводим фунты в кг
if ($unit == "lb") {
    $weigth = $weigth * $c;
    $weigth = ceil($weigth);
}

//Хранение в кг
$price["SHOPPACK"]["UA"]["Любой город"]["0"] = 0;
$price["SHOPPACK"]["UA"]["Любой город"]["1"] = 5.45;
$price["SHOPPACK"]["UA"]["Любой город"]["2"] = 10.9;
$price["SHOPPACK"]["UA"]["Любой город"]["3"] = 16.35;
$price["SHOPPACK"]["UA"]["Любой город"]["4"] = 21.8;
$price["SHOPPACK"]["UA"]["Любой город"]["5"] = 27.25;
$price["SHOPPACK"]["UA"]["Любой город"]["6"] = 32.7;
$price["SHOPPACK"]["UA"]["Любой город"]["7"] = 38.15;
$price["SHOPPACK"]["UA"]["Любой город"]["8"] = 43.6;
$price["SHOPPACK"]["UA"]["Любой город"]["9"] = 49.05;
$price["SHOPPACK"]["UA"]["Любой город"]["10"] = 54.5;
$price["SHOPPACK"]["UA"]["Любой город"]["11"] = 59.95;
$price["SHOPPACK"]["UA"]["Любой город"]["12"] = 65.4;
$price["SHOPPACK"]["UA"]["Любой город"]["13"] = 70.85;
$price["SHOPPACK"]["UA"]["Любой город"]["14"] = 76.3;
$price["SHOPPACK"]["UA"]["Любой город"]["15"] = 81.75;
$price["SHOPPACK"]["UA"]["Любой город"]["16"] = 87.2;
$price["SHOPPACK"]["UA"]["Любой город"]["17"] = 92.65;
$price["SHOPPACK"]["UA"]["Любой город"]["18"] = 98.1;
$price["SHOPPACK"]["UA"]["Любой город"]["19"] = 103.55;
$price["SHOPPACK"]["UA"]["Любой город"]["20"] = 109;
$price["SHOPPACK"]["RU"]["Любой город"]["0"] = 0;
$price["SHOPPACK"]["RU"]["Любой город"]["1"] = 32;
$price["SHOPPACK"]["RU"]["Любой город"]["2"] = 34.2;
$price["SHOPPACK"]["RU"]["Любой город"]["3"] = 51.15;
$price["SHOPPACK"]["RU"]["Любой город"]["4"] = 51.15;
$price["SHOPPACK"]["RU"]["Любой город"]["5"] = 54.13;
$price["SHOPPACK"]["RU"]["Любой город"]["6"] = 60.45;
$price["SHOPPACK"]["RU"]["Любой город"]["7"] = 66.79;
$price["SHOPPACK"]["RU"]["Любой город"]["8"] = 73.11;
$price["SHOPPACK"]["RU"]["Любой город"]["9"] = 79.46;
$price["SHOPPACK"]["RU"]["Любой город"]["10"] = 85.77;
$price["SHOPPACK"]["RU"]["Любой город"]["11"] = 92.12;
$price["SHOPPACK"]["RU"]["Любой город"]["12"] = 98.44;
$price["SHOPPACK"]["RU"]["Любой город"]["13"] = 104.78;
$price["SHOPPACK"]["RU"]["Любой город"]["14"] = 111.09;
$price["SHOPPACK"]["RU"]["Любой город"]["15"] = 117.41;
$price["SHOPPACK"]["RU"]["Любой город"]["16"] = 123.75;
$price["SHOPPACK"]["RU"]["Любой город"]["17"] = 130.07;
$price["SHOPPACK"]["RU"]["Любой город"]["18"] = 136.42;
$price["SHOPPACK"]["RU"]["Любой город"]["19"] = 142.74;
$price["SHOPPACK"]["RU"]["Любой город"]["20"] = 149.08;
$price["USPS"]["UA"]["Любой город"]["0"] = 0;
$price["USPS"]["UA"]["Любой город"]["1"] = 58.1;
$price["USPS"]["UA"]["Любой город"]["2"] = 68.2;
$price["USPS"]["UA"]["Любой город"]["3"] = 77.5;
$price["USPS"]["UA"]["Любой город"]["4"] = 86.8;
$price["USPS"]["UA"]["Любой город"]["5"] = 100.75;
$price["USPS"]["UA"]["Любой город"]["6"] = 110.05;
$price["USPS"]["UA"]["Любой город"]["7"] = 119.35;
$price["USPS"]["UA"]["Любой город"]["8"] = 128.65;
$price["USPS"]["UA"]["Любой город"]["9"] = 137.95;
$price["USPS"]["UA"]["Любой город"]["10"] = 151.9;
$price["USPS"]["UA"]["Любой город"]["11"] = 161;
$price["USPS"]["UA"]["Любой город"]["12"] = 170.5;
$price["USPS"]["UA"]["Любой город"]["13"] = 179.8;
$price["USPS"]["UA"]["Любой город"]["14"] = 189.1;
$price["USPS"]["UA"]["Любой город"]["15"] = 203.05;
$price["USPS"]["UA"]["Любой город"]["16"] = 212.35;
$price["USPS"]["UA"]["Любой город"]["17"] = 221.65;
$price["USPS"]["UA"]["Любой город"]["18"] = 230.95;
$price["USPS"]["UA"]["Любой город"]["19"] = "-";
$price["USPS"]["UA"]["Любой город"]["20"] = "-";
$price["USPS"]["RU"]["Любой город"]["0"] = 0;
$price["USPS"]["RU"]["Любой город"]["1"] = 58.1;
$price["USPS"]["RU"]["Любой город"]["2"] = 68.2;
$price["USPS"]["RU"]["Любой город"]["3"] = 77.5;
$price["USPS"]["RU"]["Любой город"]["4"] = 86.8;
$price["USPS"]["RU"]["Любой город"]["5"] = 100.75;
$price["USPS"]["RU"]["Любой город"]["6"] = 110.05;
$price["USPS"]["RU"]["Любой город"]["7"] = 119.35;
$price["USPS"]["RU"]["Любой город"]["8"] = 128.65;
$price["USPS"]["RU"]["Любой город"]["9"] = 137.95;
$price["USPS"]["RU"]["Любой город"]["10"] = 151.9;
$price["USPS"]["RU"]["Любой город"]["11"] = 161;
$price["USPS"]["RU"]["Любой город"]["12"] = 170.5;
$price["USPS"]["RU"]["Любой город"]["13"] = 179.8;
$price["USPS"]["RU"]["Любой город"]["14"] = 189.1;
$price["USPS"]["RU"]["Любой город"]["15"] = 203.05;
$price["USPS"]["RU"]["Любой город"]["16"] = 212.35;
$price["USPS"]["RU"]["Любой город"]["17"] = 221.65;
$price["USPS"]["RU"]["Любой город"]["18"] = 230.95;
$price["USPS"]["RU"]["Любой город"]["19"] = "-";
$price["USPS"]["RU"]["Любой город"]["20"] = "-";
$price["EMS"]["UA"]["Любой город"]["0"] = 0;
$price["EMS"]["UA"]["Любой город"]["1"] = 74.95;
$price["EMS"]["UA"]["Любой город"]["2"] = 85.15;
$price["EMS"]["UA"]["Любой город"]["3"] = 95.55;
$price["EMS"]["UA"]["Любой город"]["4"] = 105.95;
$price["EMS"]["UA"]["Любой город"]["5"] = 121.35;
$price["EMS"]["UA"]["Любой город"]["6"] = 131.55;
$price["EMS"]["UA"]["Любой город"]["7"] = 141.75;
$price["EMS"]["UA"]["Любой город"]["8"] = 151.95;
$price["EMS"]["UA"]["Любой город"]["9"] = 162.15;
$price["EMS"]["UA"]["Любой город"]["10"] = 177.45;
$price["EMS"]["UA"]["Любой город"]["11"] = 187.65;
$price["EMS"]["UA"]["Любой город"]["12"] = 197.85;
$price["EMS"]["UA"]["Любой город"]["13"] = 208.05;
$price["EMS"]["UA"]["Любой город"]["14"] = 218.25;
$price["EMS"]["UA"]["Любой город"]["15"] = 233.55;
$price["EMS"]["UA"]["Любой город"]["16"] = 243.75;
$price["EMS"]["UA"]["Любой город"]["17"] = 253.95;
$price["EMS"]["UA"]["Любой город"]["18"] = 264.15;
$price["EMS"]["UA"]["Любой город"]["19"] = "-";
$price["EMS"]["UA"]["Любой город"]["20"] = "-";
$price["EMS"]["RU"]["Любой город"]["0"] = 0;
$price["EMS"]["RU"]["Любой город"]["1"] = 74.95;
$price["EMS"]["RU"]["Любой город"]["2"] = 85.15;
$price["EMS"]["RU"]["Любой город"]["3"] = 95.55;
$price["EMS"]["RU"]["Любой город"]["4"] = 105.95;
$price["EMS"]["RU"]["Любой город"]["5"] = 121.35;
$price["EMS"]["RU"]["Любой город"]["6"] = 131.55;
$price["EMS"]["RU"]["Любой город"]["7"] = 141.75;
$price["EMS"]["RU"]["Любой город"]["8"] = 151.95;
$price["EMS"]["RU"]["Любой город"]["9"] = 162.15;
$price["EMS"]["RU"]["Любой город"]["10"] = 177.45;
$price["EMS"]["RU"]["Любой город"]["11"] = 187.65;
$price["EMS"]["RU"]["Любой город"]["12"] = 197.85;
$price["EMS"]["RU"]["Любой город"]["13"] = 208.05;
$price["EMS"]["RU"]["Любой город"]["14"] = 218.25;
$price["EMS"]["RU"]["Любой город"]["15"] = 233.55;
$price["EMS"]["RU"]["Любой город"]["16"] = 243.75;
$price["EMS"]["RU"]["Любой город"]["17"] = 253.95;
$price["EMS"]["RU"]["Любой город"]["18"] = 264.15;
$price["EMS"]["RU"]["Любой город"]["19"] = "-";
$price["EMS"]["RU"]["Любой город"]["20"] = "-";
$price["Fedex"]["UA"]["Любой город"]["0"] = 0;
$price["Fedex"]["UA"]["Любой город"]["1"] = 147.38;
$price["Fedex"]["UA"]["Любой город"]["2"] = 203.07;
$price["Fedex"]["UA"]["Любой город"]["3"] = 244.62;
$price["Fedex"]["UA"]["Любой город"]["4"] = 313.81;
$price["Fedex"]["UA"]["Любой город"]["5"] = 356.71;
$price["Fedex"]["UA"]["Любой город"]["6"] = 417.31;
$price["Fedex"]["UA"]["Любой город"]["7"] = 427.61;
$price["Fedex"]["UA"]["Любой город"]["8"] = 464.72;
$price["Fedex"]["UA"]["Любой город"]["9"] = 509.43;
$price["Fedex"]["UA"]["Любой город"]["10"] = 553.26;
$price["Fedex"]["UA"]["Любой город"]["11"] = 572.25;
$price["Fedex"]["UA"]["Любой город"]["12"] = 689.88;
$price["Fedex"]["UA"]["Любой город"]["13"] = 707.37;
$price["Fedex"]["UA"]["Любой город"]["14"] = 710.84;
$price["Fedex"]["UA"]["Любой город"]["15"] = 722.74;
$price["Fedex"]["UA"]["Любой город"]["16"] = 723.31;
$price["Fedex"]["UA"]["Любой город"]["17"] = 780.34;
$price["Fedex"]["UA"]["Любой город"]["18"] = 786.34;
$price["Fedex"]["UA"]["Любой город"]["19"] = "-";
$price["Fedex"]["UA"]["Любой город"]["20"] = "-";
$price["Fedex"]["RU"]["Любой город"]["0"] = 0;
$price["Fedex"]["RU"]["Любой город"]["1"] = 171.34;
$price["Fedex"]["RU"]["Любой город"]["2"] = 245.45;
$price["Fedex"]["RU"]["Любой город"]["3"] = 298.86;
$price["Fedex"]["RU"]["Любой город"]["4"] = 342.07;
$price["Fedex"]["RU"]["Любой город"]["5"] = 354.13;
$price["Fedex"]["RU"]["Любой город"]["6"] = 427.09;
$price["Fedex"]["RU"]["Любой город"]["7"] = 488.36;
$price["Fedex"]["RU"]["Любой город"]["8"] = 519.98;
$price["Fedex"]["RU"]["Любой город"]["9"] = 568.22;
$price["Fedex"]["RU"]["Любой город"]["10"] = 587.67;
$price["Fedex"]["RU"]["Любой город"]["11"] = 647.55;
$price["Fedex"]["RU"]["Любой город"]["12"] = 725.22;
$price["Fedex"]["RU"]["Любой город"]["13"] = 775.84;
$price["Fedex"]["RU"]["Любой город"]["14"] = 813.51;
$price["Fedex"]["RU"]["Любой город"]["15"] = 840.01;
$price["Fedex"]["RU"]["Любой город"]["16"] = 847.46;
$price["Fedex"]["RU"]["Любой город"]["17"] = 883.48;
$price["Fedex"]["RU"]["Любой город"]["18"] = 906.92;
$price["Fedex"]["RU"]["Любой город"]["19"] = "-";
$price["Fedex"]["RU"]["Любой город"]["20"] = "-";



//Поиск ближайшего верхнего значения в массиве
function closestNum($arr, $num) {
    //Создаем массив весов для работы
    $w_arr;
    foreach ($arr as $key => $value) {
        $w_arr[] = doubleval($key);
    }
    //Отфильтровываем значения, которые меньше указаного веса
    $more_w_arr;
    $more_w_arr = array_filter($w_arr, function ($element) use ($num) {
        return ($element >= $num);
    });
    //Берем первое из оставшегося
    return (array_shift($more_w_arr));
}

//Формируем массив ответа на 4 поставщика
$answer = array(
  "SHOPPACK" => $price["SHOPPACK"][$country][$city][closestNum($price["SHOPPACK"][$country][$city], $weigth)],
  "USPS" => $price["USPS"][$country][$city][closestNum($price["USPS"][$country][$city], $weigth)],
  "EMS" => $price["EMS"][$country][$city][closestNum($price["EMS"][$country][$city], $weigth)],
  "Fedex" => $price["Fedex"][$country][$city][closestNum($price["Fedex"][$country][$city], $weigth)]
);

//В json и в ответ
echo json_encode($answer);
?>

